<a href="https://colab.research.google.com/github/arizalalejandro/Taller_01/blob/main/oro.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:

## Importando las librerías
import pandas as pd
import numpy as np

In [4]:
dataframeGold = pd.read_csv('gold_price_data.csv')
print(dataframeGold.columns)
dataframeGold.head(10)

Index(['Date', 'Value'], dtype='object')

         Date  Value
0  1970-01-01   35.2
1  1970-04-01   35.1
2  1970-07-01   35.4
3  1970-10-01   36.2
4  1971-01-01   37.4
5  1971-04-01   38.9
6  1971-07-01   40.1
7  1971-10-01   42.0
8  1972-01-03   43.5
9  1972-04-03   48.3

In [5]:
etiqueta = np.array(dataframeGold['Value'])[2:]
car_m1 = np.array(dataframeGold['Value'])[1:-1]
car_m2 = np.array(dataframeGold['Value'])[:-2]
print(len(etiqueta))
print(len(car_m1))
print(len(car_m2))

10785
10785
10785

In [7]:
## Agrupando los datos en un único Dataframe y exportándolo a un archivo CSV
dataset = pd.DataFrame({'Carac menos 2':car_m2, 'Carac menos 1':car_m1, 'Etiqueta':etiqueta})
dataset.to_csv('goldPriceArranged.csv')

In [8]:
## Pasando los datos a una matriz de tipo numpy
matrizDatos = dataset.to_numpy()
print(matrizDatos.shape)

(10785, 3)

In [9]:
def funcCosto(arr_1, arr_2):
  J = (arr_1-arr_2)**2
  return np.sum(J)/(2*len(J))

In [14]:
J,T0,T1,min=0,0,0,100
for T0i in np.arange(-2,2,0.01):
    for T1j in np.arange(-2,2,0.01):
        h=T0i*car_m1+T1j*car_m2
        J=funcCosto(h,etiqueta)
        if(J<min):
            min=J
            T0=T0i
            T1=T1j
print(str(T0)+" "+str(T1))

0.9900000000000029 0.010000000000001563